/*(14分)假定四则运算表达式由操作数(数字及至多1个小数点)、运算符
(仅+、-、*、/)以及小括号((和))组成。请编写一个程序,又对于给定的一个
四则运算表达式,识别出其中的操作数,顺序存储在二维字符数约Ops[10][10][10]
中(每个一行,不会越界),并依次输出在屏幕上。
输入格式:在一行中给出长度不超过100个字符的四则运算:表达式,仅由上述
字符组成无空格,无需做正确性检查。
输出格式:依次输出式中各操作数,每个一行。
输入样例:
32*(62-5)
输出样例:
32
62
5*/

#include <stdio.h>
#include <string.h>
int main()
{
	char str[101];
	char Ops[10][10]={};
	int i;
	int ord=0, j=0;
	scanf("%s", str);
	for(i=0; i<strlen(str); i++){
		if(str[i] >= '0' && str[i] <= '9' || str[i] == '.'){
			Ops[ord][j] = str[i];
			j++;
		}
		else if(j==0) ;
		else{
			ord++;
			j=0;
		}
	}
	for(j=0; j<=9; j++){
		for(i=0; i<=9; i++){
			printf("%c", Ops[j][i]);
		}
		printf("\n");
	}
	
	return 0;
}